{
  "product_name": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09",
  "chunks": [
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_0",
      "text": "A single improper change to Microsoft Active Directory, whether accidental or deliberate, can lead to disaster.",
      "chunk_index": 0,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_1",
      "text": "Alter the wrong Group Policy setting and suddenly users are free to install ransomware on their machines or copy data to USB drives.",
      "chunk_index": 1,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_2",
      "text": "Make the wrong person a member of an Active Directory group and they’ll be able to read, access or delete files they shouldn’t.",
      "chunk_index": 2,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_3",
      "text": "Even more devastating, a cyberattack, hardware failure, internal error, or natural calamity can bring down your entire Active Directory forest.",
      "chunk_index": 3,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_4",
      "text": "Native tools don’t make it easy to revert these critical changes — but Netwrix Recovery for Active Directory does.",
      "chunk_index": 4,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_5",
      "text": "Administrators can quickly rollback and recover Active Directory objects or just a single attribute to a known good state, with little to no downtime.",
      "chunk_index": 5,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_6",
      "text": "Getting Started This topic provides information on installing and configuring Netwrix Recovery for Active Directory, which enables organizations to quickly and easily roll back and recover unintended directory changes.",
      "chunk_index": 6,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_7",
      "text": "Installation Requirements Before installing Recovery for Active Directory, review the recommended configuration of the servers needed to install this product in a production environment.",
      "chunk_index": 7,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_8",
      "text": "v2.6 First Launch Launch Recovery for Active Directory using the desktop icon and sign in with the administrator role account that was configured during installation.",
      "chunk_index": 8,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_9",
      "text": "Initial Configuration Several Recovery for Active Directory components require configuration after the first launch of the product.",
      "chunk_index": 9,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_10",
      "text": "Configure Domain Backup – On logging into the Recovery Console, you land on the Domain Backup Configuration Page, that directs you to configure a domain to be backed up.",
      "chunk_index": 10,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_11",
      "text": "Configure Forest Backup – Configure a forest and then configure backup settings for domain controllers in the forest.",
      "chunk_index": 11,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_12",
      "text": "(Optional) Install RSAT Extension on Additional Servers – The RSAT Extension.msi is automatically installed with the Recovery for Active Directory application on the application server.",
      "chunk_index": 12,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_13",
      "text": "Configure Additional Users – The user or group configured during installation of the product has administrator access to the Recovery Console.",
      "chunk_index": 13,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_14",
      "text": "(Optional) Configure Notifications – Email notifications require configuration before they can be enabled.",
      "chunk_index": 14,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_15",
      "text": "Rollback and Restore Operations Now that the initial configuration of Recovery for Active Directory is complete and backups have been created, you can rollback and recover Active Directory objects, as well as restore domain controllers.",
      "chunk_index": 15,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_16",
      "text": "See announcements for Netwrix Recovery for Active Directory in the Recovery for Active Directory area of our new community.",
      "chunk_index": 16,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_17",
      "text": "The following information highlights the new and improved features introduced in this Netwrix Recovery for Active Directory version.",
      "chunk_index": 17,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_18",
      "text": "If your domain controllers get corrupted, encrypted due to ransomware, or even completely wiped out either intentionally or accidentally, you can always recover your Active Directory forest from a secure backup.",
      "chunk_index": 18,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_19",
      "text": "v2.6 New: Automated AD Forest Recovery Enhance the availability of your Active Directory with a rapid and reliable automated recovery process for entire Active Directory forests and domains.",
      "chunk_index": 19,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_20",
      "text": "Benefit from significantly improved storage optimization, reducing backup sizes from 20GB to just 10MB.",
      "chunk_index": 20,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_21",
      "text": "New: Flexible Backup and Restore Options Backup and restore physical or virtual domain controllers regardless of their hosting environment.",
      "chunk_index": 21,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_22",
      "text": "Maximize flexibility and ensure seamless recovery processes for any Active Directory infrastructure.",
      "chunk_index": 22,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_23",
      "text": "New: Data Retention Policy Stale data can now be purged from the database using a configurable range and options.",
      "chunk_index": 23,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_24",
      "text": "New: Integration with Netwrix Threat Prevention (formerly StealthINTERCEPT) Improve threat detection and response by combining Active Directory change data with realtime security intelligence from Netwrix Threat Prevention.",
      "chunk_index": 24,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_25",
      "text": "This integration provides a comprehensive view of AD activity, enabling faster incident investigation and resolution.",
      "chunk_index": 25,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_26",
      "text": "Enhancement: Unified Interface for Object Rollback and Recovery The Rollback and Recover navigation items have been merged into a consolidated Active Directory interface to enhance user experience.",
      "chunk_index": 26,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_27",
      "text": "Enhancement: Additional Audit Details View detailed information on audit events generated by the product, such as what settings were updated and what constitutes the change.",
      "chunk_index": 27,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_28",
      "text": "Use Cases Recovery for Active Directory enables you to rollback and recover both accidental and malicious changes to Active Directory.",
      "chunk_index": 28,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_29",
      "text": "Recover a Deleted Object Deleted objects can be difficult to recover natively without the Active Directory Recycle Bin enabled, which is not enabled by default.",
      "chunk_index": 29,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_30",
      "text": "While enabling the Recycle Bin enhances the restore v2.6 process, it is not a requirement for Recovery for Active Directory.",
      "chunk_index": 30,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_31",
      "text": "An example of when a deleted object may need to be restored is: A user account has been accidentally deleted and it needs to be reinstated Restoring a deleted object can be accomplished through the following interface in the Recovery for Active Directory Console: Active Directory Page ◦ Locate the desired object in the Recycle Bin.",
      "chunk_index": 31,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_32",
      "text": "Rollback Changes to an Object Active Directory does not offer native ways to undo changes made to objects.",
      "chunk_index": 32,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_33",
      "text": "An example of when a change to an object may need to be rolled back is: Someone made a group membership change that impacted a user’s access Rolling back object changes can be accomplished through the following interface in the Recovery for Active Directory Console: Active Directory Page ◦ Locate the desired object ◦ Rollback changes to the object by following the steps in the Rollback Objects topic Rollback Attribute Changes A massive number of attributes changes in Active Directory can cause significant security and operational issues.",
      "chunk_index": 33,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_34",
      "text": "Some examples of when a change to an attribute may need to be rolled back are: Joe’s department attribute was changed and needs to be rolled back to what it was originally A user’s display name was changed and needs to be rolled back Rolling back attribute changes can be accomplished through the following interface within the Recovery for Active Directory Console: Active Directory Page v2.6 ◦ Locate the desired object ◦ Rollback changes to the object by following the steps in the Rollback Objects topic Remember to select the desired attribute for rollback Rollback Group Policy Object Changes Group Policy Objects (GPOs) control many aspects of operations, security, and software deployment.",
      "chunk_index": 34,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_35",
      "text": "For this, Group Policy Management Console must be installed on the Recovery for Active Directory server.",
      "chunk_index": 35,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_36",
      "text": "An example of when a GPO change may need to be rolled back is: A GPO change caused users to lose access to a server or application Rolling back GPO changes can be accomplished through the following interface in the Recovery for Active Directory Console: Active Directory Page ◦ Locate the desired object ◦ Rollback changes to the object by following the steps in the Rollback Objects topic Domain Controller Backup and Forest Restore from Backup Recovery for Active Directory can backup domain controllers to prevent data loss.",
      "chunk_index": 36,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_37",
      "text": "You can then restore a domain controller backup using the backup file created by Recovery for Active Directory.",
      "chunk_index": 37,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_38",
      "text": "To restore a forest, you can create a playbook to restore the domain controllers in a desired sequence.",
      "chunk_index": 38,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_39",
      "text": "Some examples of when a server may need to be backed up or restored are: Stand up a duplicate of a domain controller, for example, stand up a duplicate in a lab environment for testing purposes Restore a domain controller to a specific state-in-time image Restore lost or deleted data Server backup and restore can be accomplished through the following interfaces: Forest Page v2.6 ◦ Configure backup settings for domain controllers ◦ Restore one or more domain controllers in a forest by following the steps in the Create a Recovery Playbook topic v2.6 Requirements This topic describes the recommended configuration of the servers needed to install Recovery for Active Directory in a production environment.",
      "chunk_index": 39,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_40",
      "text": "RECOMMENDED: Review your environment and requirements with a Netwrixsupport engineer prior to deployment to ensure all exceptions are covered.",
      "chunk_index": 40,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_41",
      "text": "Architecture Overview The following servers are required for installation of the application: Core Component v2.6) application is installed SQL Server for Recovery for Active Directory Database – As a data-intensive application, a well-provisioned, dedicated SQL Server is recommended RSAT Extension – Active Directory Users and Computers extension enabling Recovery for Active Directory features from within Microsoft management utilities See the following topics for server requirements: Application Server Requirements SQL Server Requirements RSAT Extension Requirements Target Domain Considerations The target domains include the Active Directory domains that can be added through the Domains Page.",
      "chunk_index": 41,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_42",
      "text": "See the following topic for target domain considerations: Target Domains Table 1: Environment Large Medium Small Definition Greater than 100,000 objects Between 25,000 and 100,000 objects Less than 25,000 objects RAM 32 GB 16 GB 8 GB v2.6 Target Server Considerations Target servers include the servers and environments where you want to restore a domain controller or an entire forest.",
      "chunk_index": 42,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_43",
      "text": "See the following topic for target server requirements: Target Server Considerations Application Server Requirements The Windows Server can be physical or virtual.",
      "chunk_index": 43,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_44",
      "text": "The following Windows Server operating systems are supported: Windows Server 2022 Windows Server 2019 Windows Server 2016 Windows Server 2012 R2 Windows Server 2012 Additionally the server must meet these requirements: Domain-joined server 2.0 GHz or faster dual core 64-bit (x64) processor RAM and Disk Space These are dependent upon the total number of Active Directory objects.",
      "chunk_index": 44,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_45",
      "text": "Environment Large Medium Small Greater than 100,000 Between 25,000 and Definition Less than 25,000 objects objects 100,000 objects RAM 32 GB 16 GB 8 GB Table 1: Environment Large Medium Small Disk Space 1 TB *SSD preferred 250 GB 100 GB v2.6 Environment Large Medium Small 1 TB Disk Space 250 GB 100 GB SSD preferred Additional Server Requirements The Recovery for Active Directory installer checks if .Net 8.06 is installed on the machine.",
      "chunk_index": 45,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_46",
      "text": "Install the msoledbsql.msi to enable the application server to connect to the SQL Server prior to starting installation NOTE: The latest msoledbsql.msi can be obtained from Microsoft's website.",
      "chunk_index": 46,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_47",
      "text": "Group Policy Management Console (required to backup and to recover GPOs) Optional: SQL Server Management Studio installed on the application server Permissions for Installation The following permission is required to install the application: Membership in the local Administrators group Log on as a service right from the Local Security Policy (Local Policies > User Rights Assignment > Log on as a service policy) SQL Server permissions – Domain account needs to be granted SQL Server permissions.",
      "chunk_index": 47,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_48",
      "text": "Recovery Configuration Utility – Must have Domain Admin rights to use all options in this utility Virtual Environment Recommendations While physical machines are always preferred, we fully support the use of virtual machines.",
      "chunk_index": 48,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_49",
      "text": "Table 1: Environment Large Medium Small Definition 15,000 - 1 million+ AD objects 2,000 - 15,000 AD objects Up to 2,000 AD objects RAM 64+ GB 32 GB 16 GB Cores 4+ CPU 4 CPU 2 CPU Disk Space 256 GB 64 GB 16 GB v2.6 SQL Server Requirements The Windows server can be physical or virtual.",
      "chunk_index": 49,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_50",
      "text": "The following Windows server operating systems are supported: Windows Server 2022 Windows Server 2019 Windows Server 2016 Windows Server 2012 R2 Windows Server 2012 The server requirements for the SQL Server databases are: SQL Server 2022 SQL Server 2019 SQL Server 2017 SQL Server 2016 SQL Server 2014 SQL Server 2012 RAM, CPU, and Disk Space These depend on the size of the target environment.",
      "chunk_index": 50,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_51",
      "text": "Environment Large Medium Small 15,000 - 1 million+ AD Definition 2,000 - 15,000 AD objects Up to 2,000 AD objects objects RAM 64+ GB 32 GB 16 GB Cores 4+ CPU 4 CPU 2 CPU Disk Space 256 GB 64 GB 16 GB v2.6 Additional Server Requirements The following are additional requirements for the SQL Server: All SQL Server databases configured to use ‘Simple Recovery Model’ Database Permissions The following permissions are required on the databases for the accounts used to run Recovery for Active Directory: Create a database Create Tables Read/Write Additional Considerations The following additional considerations are recommended for the SQL Server: Microsoft SQL Server supports TLS 1.2, which requires the Recovery for Active Directory server to have either SQL Server Native Client 11 or Microsoft Ole DB 18 installed.",
      "chunk_index": 51,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_52",
      "text": "Optional: SQL Server Management Studio installed on the Recovery for Active Directory server RSAT Extension Requirements The following prerequisite is required to run the RSAT Extension: Remote Server Administration Tools (RSAT) must be installed Target Domains Target domains include the Active Directory domains that can be added through the Domains Page.",
      "chunk_index": 52,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_53",
      "text": "Recovery for Active Directory can backup domains on servers with the Active Directory role on the following operating system versions: Windows Server 2022 Windows Server 2019 v2.6 Windows Server 2016 Windows Server 2012 R2 Windows Server 2012 Service Account Permissions The service account used to run backups, and perform rollback and recovery tasks for a domain is specified on the Domain page of the Add Domain Configuration wizard.",
      "chunk_index": 53,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_54",
      "text": "This account must be: A member of the Domain Administrators group in the target domain There is a Least Privilege Access Model to provision an Active Directory security group with the permissions that are necessary to perform backups, rollbacks and recovery.",
      "chunk_index": 54,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_55",
      "text": "Least Privilege Access Model It is strongly suggested that the Recovery for Active Directory service account be provided Domain Admin privileges; however, there are situations where security policies prevent an organization from providing Domain Admin privileges.",
      "chunk_index": 55,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_56",
      "text": "In those situations, please contact your Netwrix service representative to work with you to develop a tailored Least Privilege Access model based on your environment.",
      "chunk_index": 56,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_57",
      "text": "The privileges necessary to facilitate normal backup and recovery operations of an Active Directory environment, which are normally available to the Domain Administrators security group, include the following permissions: Membership in the Schema Admins group is necessary to facilitate backups of objects within the domain's Schema Container The following permissions on the domain's default naming context are necessary to facilitate backups and rollbacks of its Active Directory objects: ◦◦ ALLOW – Write Property right (SelfAndChildren) ◦◦ ALLOW – Create Child right (SelfAndChildren) ◦◦ ALLOW – Replicating Directory Changes extended right (SelfAndChildren) ◦◦ ALLOW – Reanimate Tombstones extended right (SelfAndChildren) v2.6 The following permissions on the domain's DomainDnsZones and ForestDnsZones partitions are necessary to facilitate backups and rollbacks of Active Directory DNS objects: ◦◦ ALLOW – Write Property right (SelfAndChildren) ◦◦ ALLOW – Create Child right (SelfAndChildren) ◦◦ ALLOW – Replicating Directory Changes extended right (SelfAndChildren) ◦◦ ALLOW – Reanimate Tombstones extended right (SelfAndChildren) The following permissions on the domain's Sites container are necessary to facilitate backups and rollbacks of Active Directory Sites and Services objects: ◦◦ ALLOW – Generic Read right (SelfAndChildren) ◦◦ ALLOW – Generic Write right (SelfAndChildren) ◦◦ ALLOW – Create Child right (SelfAndChildren) ◦◦ ALLOW – Replicating Directory Changes extended right (SelfAndChildren) ◦◦ ALLOW – Reanimate Tombstones extended right (SelfAndChildren) The following Group Policy access rights are necessary to facilitate backups and rollbacks of Group Policy Objects: ◦◦ READ ◦◦ WRITE ◦◦ CREATE CHILD OBJECT ◦◦ DELETE CHILD OBJECT ◦◦ DELETE ◦◦ MODIFY PERMISSIONS ◦◦ MODIFY OWNER CAUTION: Additional permissions may be necessary to allow RECOVERY FOR ACTIVE DIRECTORY to function properly in an organization’s environment.",
      "chunk_index": 57,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_58",
      "text": "v2.6 Target Server Considerations This topic lists the requirements for the target servers where you want to restore the domain controllers for performing a forest recovery.",
      "chunk_index": 58,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_59",
      "text": "Target Server and Operating System Requirements Consider the following when restoring domain controllers.",
      "chunk_index": 59,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_60",
      "text": "The target servers must be isolated from the environment in such a way that they cannot name-resolve the domain that is restored.",
      "chunk_index": 60,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_61",
      "text": "The process of restoring a domain will fail if the server is able to see that a domain of that name already exists.",
      "chunk_index": 61,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_62",
      "text": "Typically, DNS in the target environment used for forest recovery should be configured in a way that allows each server in that environment to see each other.",
      "chunk_index": 62,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_63",
      "text": "The target server OS version should be the same version as the source domain controllers from which the backups were created.",
      "chunk_index": 63,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_64",
      "text": "For example, a backup from a Windows Server 2022 domain controller would need to be restored to a Windows Server 2022 target server.",
      "chunk_index": 64,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_65",
      "text": "While restoring a domain controller, things such as the ADDS role and configuration are done with the product, so there is no requirement to have those in place.",
      "chunk_index": 65,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_66",
      "text": "When the Target Server is a Virtual Machine Following are some considerations when the target server is a virtual machine.",
      "chunk_index": 66,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_67",
      "text": "Memory and storage configuration for the virtual machine should match the hardware configuration of the domain controller where the backup was performed.",
      "chunk_index": 67,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_68",
      "text": "The virtual machine should be in an isolated environment (i.e., should not be able to contact the source forest or domains).",
      "chunk_index": 68,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_69",
      "text": "Table 1: Communic ation Direction Protocol Ports Description Domain Controller to Application Server TCP 9001 Outbound Communication Application Server to Domain Controller TCP 9001 Inbound Communication v2.6 The virtual machines should allow File and Print Sharing through the firewall as well as Remote Management, if possible.",
      "chunk_index": 69,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_70",
      "text": "Network Bandwidth Requirement for the Restore Operation Network bandwidth should be as fast as available but can operate efficiently with 100 Mbps.",
      "chunk_index": 70,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_71",
      "text": "Slower bandwidth will result in a longer setup stage for the restore as the backup container has to be copied to the target server.",
      "chunk_index": 71,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_72",
      "text": "Firewall Rules for Forest Server Backups The following firewall settings are required for communicating with Recovery for Active Directory and the domain controller when executing a domain controller backup.",
      "chunk_index": 72,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_73",
      "text": "Communic ation Protocol Ports Description Direction Domain Controller to TCP 9001 Outbound Communication Application Server Application Server to TCP 9001 Inbound Communication Domain Controller NOTE: 9001 is the default port.",
      "chunk_index": 73,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_74",
      "text": "If a different port is specified on the Netwrix Recovery Server Configuration page of the Recovery for Active Directory Setup wizard while installing the application, then that specific port is applicable here.",
      "chunk_index": 74,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_75",
      "text": "v2.6 Installation Recovery for Active Directory consists of the following components: Netwrix Recovery Server Netwrix Recovery Web Console – Installed on the Recovery Application Server and used to perform the operations the application offers RSAT Extension – Installed on the Recovery Application Server automatically.",
      "chunk_index": 75,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_76",
      "text": "You can manually install it on a remote machine to add the object rollback and restore functions to the Active Directory Users and Computers console on that machine.",
      "chunk_index": 76,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_77",
      "text": "Recovery Configuration Utility – Installed on the Recovery Application Server and used to register the RSAT Extension on the server.",
      "chunk_index": 77,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_78",
      "text": "The following services are also installed on the Recovery Application Server: Netwrix Recovery Server service Netwrix Recovery Web Console service To install the application, see the following topics: Install the Application Configuration Utility Install the RSAT Extension Prior to installing, ensure that all prerequisites have been met, as described in the Requirements topic.",
      "chunk_index": 78,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_79",
      "text": "v2.6 Software Download Current customers can log in to the Netwrix Customer Portal to download software binaries and license keys for purchased products.",
      "chunk_index": 79,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_80",
      "text": "See the Customer Portal Access topic for information on how to register for a Customer Portal account.",
      "chunk_index": 80,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_81",
      "text": "Install the Application The following components are installed by the Recovery for Active Directory installation package: Netwrix Recovery Server Netwrix Recovery Web Console – Installed on the Recovery Application Server and used to perform the operations the application offers RSAT Extension – Installed on the Recovery Application Server automatically.",
      "chunk_index": 81,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_82",
      "text": "You can manually install it on a remote machine to add the object rollback and restore functions to the Active Directory Users and Computers console on that machine.",
      "chunk_index": 82,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_83",
      "text": "Recovery Configuration Utility – Installed on the Recovery Application Server and used to register the RSAT Extension on the server.",
      "chunk_index": 83,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_84",
      "text": "During a fresh installation, it is possible to modify both or either the application installation directory and the SQL Server database location.",
      "chunk_index": 84,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_85",
      "text": "The application installation directory can be modified through the Destination Folder page in the Recovery for Active Directory Setup Wizard.",
      "chunk_index": 85,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_86",
      "text": "NOTE: The msoledbsql.msi must be installed on the machine the Recovery Application Server will be installed on, prior to installing the Recovery Application Server.",
      "chunk_index": 86,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_87",
      "text": "Step 1 – Run the NetwrixRecovery_Setup.exe executable as an administrator to launch the Recovery for Active Directory Setup wizard.",
      "chunk_index": 87,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_88",
      "text": "v2.6 Step 2 – On the Netwrix Recovery for Active Directory page, read the End User License Agreement.",
      "chunk_index": 88,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_89",
      "text": "v2.6 Step 3 – On the Welcome page of the Recovery for Active Directory Setup wizard, click Next to begin the installation.",
      "chunk_index": 89,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_90",
      "text": "v2.6 Step 4 – On the Destination Folder page, confirm the destination path where the wizard will install Recovery for Active Directory.",
      "chunk_index": 90,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_91",
      "text": "The default installation location is: C:\\Program Files\\Netwrix\\Recovery for Active Directory\\ (Optional) Click Change… to change the installation location.",
      "chunk_index": 91,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_92",
      "text": "Trial license – Use the 14-day license key that comes packaged with the Recovery for Active Directory installation License file – Map to a customer license key file by clicking Browse and selecting the license file with the name ending in .key Click Next.",
      "chunk_index": 92,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_93",
      "text": "v2.6 Step 6 – On the SQL Server Configuration page, specify the SQL server and credentials to use for database communication.",
      "chunk_index": 93,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_94",
      "text": "SQL Server – Enter the SQL Server fully-qualified DNS location name or IP address of the SQL Server machine.",
      "chunk_index": 94,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_95",
      "text": "If SQL Server Authentication is selected, provide the login credentials for the provisioned account.",
      "chunk_index": 95,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_96",
      "text": "Ensure that this account has access to read and write to the tables with permissions to execute stored procedures.",
      "chunk_index": 96,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_97",
      "text": "Once the database is created, Windows authentication will use the credentials of the account used for the Recovery for Active Directory service., specified on the Netwrix Recovery Server Configuration page of the wizard.",
      "chunk_index": 97,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_98",
      "text": "v2.6 Step 8 – On the Netwrix Recovery Server Configuration page, enter the port and credentials to be used for running the application server.",
      "chunk_index": 98,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_99",
      "text": "Service Account – Enter the service account [DOMAIN\\USERNAME] and password credentials used to start and run the Recovery Console service.",
      "chunk_index": 99,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_100",
      "text": "Ensure that this service account has the Log On As A Service right in the Local Security Policies on the server where the console is installed.",
      "chunk_index": 100,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_101",
      "text": "By default, this is set to the Domain Admins account from the domain the product is being installed into.",
      "chunk_index": 101,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_102",
      "text": "Account – Enter a user account or group [DOMAIN\\ACCOUNT] that will be the default Recovery for Active Directory administrator.",
      "chunk_index": 102,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_103",
      "text": "The specified user or group will be responsible for configuring the applcation and managing users' access to the console.",
      "chunk_index": 103,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_104",
      "text": "v2.6 Step 10 – On the Web Host page, specify the web host configuration for the Recovery for Active Directory Console.",
      "chunk_index": 104,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_105",
      "text": "v2.6 The Certificates window displays installed certificates on either the local machine or the current user.",
      "chunk_index": 105,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_106",
      "text": "v2.6 Step 12 – The installation process begins and the Setup wizard displays the installation progress.",
      "chunk_index": 106,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_107",
      "text": "Configuration Utility On installing Recovery for Active Directory, the Recovery Configuration Utility is installed on the same server.",
      "chunk_index": 107,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_108",
      "text": "To launch the Recovery Configuration Utility, double-click the Recovery_Config.exe executable at the following location in the Recovery for Active Directory installation directory: ...Netwrix\\Recovery for Active Directory\\Recovery_Config.exe v2.6 The Recovery Configuration Utility window has options to: Register/unregister the RSAT Extension on the Recovery Application Server Update the Recovery for Active Directory database information View product licensing information Register/Unregister the RSAT Extension The RSAT Extension is an MMC snap-in that can be installed on domain joined machines.",
      "chunk_index": 108,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_109",
      "text": "It extends the Active Directory Users and Computers (ADUC) console with Recovery for Active Directory specific right-click options for object rollback and recovery.",
      "chunk_index": 109,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_110",
      "text": "Consider the following: The RSAT Extension is automatically installed with the Recovery for Active Directory installation package on the Recovery Application Server.",
      "chunk_index": 110,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_111",
      "text": "The local Extension must be registered on the server to enable the rollback and restore options in ADUC.",
      "chunk_index": 111,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_112",
      "text": "The Extension connects to the Recovery Application Server using the server name or IP address you provide while installing the Extension on the remote machine.",
      "chunk_index": 112,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_113",
      "text": "v2.6 Register the RSAT Extension You must register the RSAT Extension on the Recovery Application Server to add the Rollback and Restore options to the ADUC console.",
      "chunk_index": 113,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_114",
      "text": "Step 1 – On the Recovery Configuration Utility window, click the Register button to register the RSAT Extension.",
      "chunk_index": 114,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_115",
      "text": "Step 2 – Click OK. Unregister the RSAT Extension Unregistering the RSAT Extension will remove the Rollback and Restore options from the Active Directory Users and Computers console.",
      "chunk_index": 115,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_116",
      "text": "Step 1 – On the Recovery Configuration Utility window, click the Unregister button to unregister the RSAT Extension.",
      "chunk_index": 116,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_117",
      "text": "v2.6 Step 2 – Click OK. View SQL Configurations The Recovery Configuration Utility window displays the following information for SQL configuration: SQL Server – The fully-qualified DNS location name or IP address of the SQL Server machine that hosts the Recovery for Active Directory database Database – The name of the Recovery for Active Directory database on the server Authentication – Choose between Windows Authentication or SQL Server Authentication credentials.",
      "chunk_index": 117,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_118",
      "text": "If SQL Server Authentication is selected, provide the login credentials for the provisioned account in the Login and Password fields.",
      "chunk_index": 118,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_119",
      "text": "Test – Click the Test button to verify the authentication connection Save – After making any changes, click the Save button to save the configuration To update the password for the SQL server service account, see the Update SQL Server Service Account Password topic.",
      "chunk_index": 119,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_120",
      "text": "View License Information On the Recovery Configuration Utility window, click the License Information button to open the License Information window that displays the validity of the Recovery for Active Directory license, its type, and expiration date.",
      "chunk_index": 120,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_121",
      "text": "First Launch To launch the Recovery Console, either: Click the desktop icon Type http:/localhost:3005 in a web browser and press Enter v2.6 First Login On the first login to the Recovery Console, use the credentials configured on the Administrator Role page during installation.",
      "chunk_index": 121,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_122",
      "text": "Step 2 – Log in with credentials configured on the Administrator Role page of the Recovery for Active Directory Setup wizard during installation.",
      "chunk_index": 122,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_123",
      "text": "Once these users have access, see the Log into the Recovery Console topic for information on accessing and signing into the Recovery Console.",
      "chunk_index": 123,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_124",
      "text": "Log into the Recovery Console When Recovery for Active Directory is installed, the following icon is displayed on the desktop.",
      "chunk_index": 124,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_125",
      "text": "Access the Recovery Console Locally Administrator and non-administrator users can access the Recovery Console on the Recovery for Active Directory server using either of the following methods: Click the desktop icon Type http:/localhost:3005 in a web browser and press Enter NOTE: If the port number and web protocol was changed from default during the installation process, use the port and protocol configured from the install.",
      "chunk_index": 125,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_126",
      "text": "Enter the host name or IP address of the Recovery for Active Directory application server followed by web port number into the address bar.",
      "chunk_index": 126,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_127",
      "text": "For example: http://[ServerName]:3005 v2.6 NOTE: If the port number and web protocol was changed from default during the installation process, use the port and protocol configured from the install.",
      "chunk_index": 127,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_128",
      "text": "Sign In On First Launch of the Recovery Console, the administrator must add users who can sign into the application and use it.",
      "chunk_index": 128,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_129",
      "text": "If you have enabled multi-factor authentication for your account, the following is displayed: Step 4 – Launch the Authenticator app on your phone to get the verification code generated for the Recovery application account.",
      "chunk_index": 129,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_130",
      "text": "Install the RSAT Extension The RSAT Extension is installed automatically on the machine where the Recovery Application Server and web console are installed.",
      "chunk_index": 130,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_131",
      "text": "To use the RSAT Extension on a remote machine where Active Directory Users and Computers (ADUC) is installed, you have to manually install it using the RSAT installer.",
      "chunk_index": 131,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_132",
      "text": "The installer is located in the following installation directory on the Recovery Application Server: ...Netwrix\\Recovery for Active Directory\\RSAT Extension\\NetwrixRecovery_RSAT_Extension.msi Follow the steps to install the RSAT Extension.",
      "chunk_index": 132,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_133",
      "text": "Step 1 – Copy the NetwrixRecovery_RSAT_Extension.msi file to the machine where you want to install it.",
      "chunk_index": 133,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_134",
      "text": "v2.6 Step 4 – On the End-User License Agreement page, read the End User License Agreement and check the I accept the terms in the License Agreement box.",
      "chunk_index": 134,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_135",
      "text": "The default path is: C:\\Program Files\\Netwrix\\Recovery for Active Directory RSAT Extension\\ Optionally, you can change the installation directory location for the RSAT Extension.",
      "chunk_index": 135,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_136",
      "text": "v2.6 Step 6 – In the Server name field, enter the name or IP address of the Recovery Application Server, so the RSAT Extension identifies it in the environment.",
      "chunk_index": 136,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_137",
      "text": "If a different port is specified on the Netwrix Recovery Server Configuration page of the Recovery for Active Directory Setup wizard while installing the application, then that specific port is applicable here.",
      "chunk_index": 137,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_138",
      "text": "After installation has completed, open a new instance of ADUC and verify that the RSAT Extension has been successfully installed.",
      "chunk_index": 138,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_139",
      "text": "Upgrade Procedure This topic describes the steps needed to upgrade Netwrix Recovery for Active Directory from v2.5 to v2.6.",
      "chunk_index": 139,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_140",
      "text": "v2.6 v2.5 v2.6 Run the NetwrixRecovery_Setup.exe on the Netwrix Recovery for Active Directory server to upgrade to the newer version of the product.",
      "chunk_index": 140,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_141",
      "text": "v2.6 Administration Netwrix Recovery for Active Directory enables administrators to manage Active Directory in the following ways: Perform Object-level Rollback and Recovery ◦◦ Add Domains – Add an Active Directory domain and configure a backup schedule for it ◦◦ Rollback Objects – Quickly revert entire AD objects or just a single attribute to a known good state from a backup ◦◦ Recover Objects – Restore tombstone objects to active state using the backup data.",
      "chunk_index": 141,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_142",
      "text": "Recover object attributes, group membership, DNS entries, Group Policy objects (GPOs) and more, thus overcoming key limitations of the Recycle Bin.",
      "chunk_index": 142,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_143",
      "text": "Perform Forest Backup and Recovery ◦◦ Add Forests – Add a forest and then configure a backup schedule for each of the domain controllers in it ◦◦ Recover a Forest – In the event of a disaster scenario (ransomware, complete hardware failure, etc.",
      "chunk_index": 143,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_144",
      "text": "), leverage the backups with the automation capabilities in the product to restore the forest back to its fully functional state prior to the disaster View Audit Log – Track the actions performed by users in Recovery for Active Directory Integrate with Netwrix products – Fetch specific data from other Netwrix products, such as Threat Prevention, to display in Recovery for Active Directory DNS Records DNS records must be stored in Active Directory in order to backup, restore, and view DNS objects in Recovery for Active Directory.",
      "chunk_index": 144,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_145",
      "text": "Navigate the Console In the Recovery Console, navigation options are displayed in the: Application header Left navigation pane v2.6 Application Header The application header contains the following icons in the top right corner: Help Center – Click the ?",
      "chunk_index": 145,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_146",
      "text": "icon to open the Netwrix Technical Knowledge Center for the Recovery for Active Directory documentation User Profile – On clicking the profile icon, the following options are displayed: ◦◦ Manage – Click it to open the MFA page, where you can set up multi-factor authentication for your Recovery for Active Directory account.",
      "chunk_index": 146,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_147",
      "text": "◦◦ Log out – Click it to sign out of the Recovery Console Navigation Pane The navigation pane contains the following links: Active Directory Page – The Active Directory page lists the domains configured in Recovery for Active Directory.",
      "chunk_index": 147,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_148",
      "text": "Forest Page – The Forest page displays your Active Directory forest with its domains and domain controllers.",
      "chunk_index": 148,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_149",
      "text": "Administrators can set up backup configurations for domain controllers as well as recover the forest from those backups.",
      "chunk_index": 149,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_150",
      "text": "Audit Logs Page – The Audit Logs page provides an audit trail of the actions performed by users in Recovery for Active Directory.",
      "chunk_index": 150,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_151",
      "text": "v2.6 Configuration Interface – The Configuration interface provides access to configure the domains, users and roles, notifications, integrations, data retention policy, and licensing for Recovery for Active Directory.",
      "chunk_index": 151,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_152",
      "text": "◦◦ Domains Page – The Domains page provides a list of the domains backed up by Recovery for Active Directory.",
      "chunk_index": 152,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_153",
      "text": "◦◦ Users and Roles Page – The Users and Roles page displays the accounts with access to Recovery for Active Directory.",
      "chunk_index": 153,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_154",
      "text": "◦◦ Notifications Page – The Notifications page allows the configuration of n otifications, which is required for sending an email when a collection (backup) job is completed.",
      "chunk_index": 154,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_155",
      "text": "◦◦ Netwrix Integrations Page – The Netwrix Integrations page provides the ability to configure access to the data in other Netwrix products.",
      "chunk_index": 155,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_156",
      "text": "◦◦ Data Retention Policy Page – The Data Retention Policy page provides settings for deleting backup data that of domains and domain controllers has aged by X number of days, and for deleting backup data for tombstone objects that have been purged.",
      "chunk_index": 156,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_157",
      "text": "◦◦ Licensing Page – The Licensing page provides an overview of the organization's license status and the ability to import a license file.",
      "chunk_index": 157,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_158",
      "text": "Configure Multi-Factor Authentication You can configure multi-factor authentication (MFA) for your Recovery for Active Directory account to add an additional layer of security when signing into the application.",
      "chunk_index": 158,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_159",
      "text": "As a prerequisite to enabling MFA, install an authenticator app, such as Google Authenticator or Microsoft Authenticator, on your phone.",
      "chunk_index": 159,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_160",
      "text": "v2.6 Step 1 – In the Recovery Console, click your profile icon in the top right corner of the page and select Manage.",
      "chunk_index": 160,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_161",
      "text": "A new account is created in the app for the Recovery application and a verification code is displayed under the account name.",
      "chunk_index": 161,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_162",
      "text": "Step 4 – Enter this code in the Verification Code field on the Configure authenticator app page and click Verify.",
      "chunk_index": 162,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_163",
      "text": "The authenticator app generates a new code every 30 seconds, with each code expiring after 30 seconds.",
      "chunk_index": 163,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_164",
      "text": "Now you must authenticate your account using the Authenticator app every time you sign into Recovery for Active Directory.",
      "chunk_index": 164,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_165",
      "text": "v2.6 Disable Authenticator for MFA Follow the steps to disable MFA for your Recovery for Active Directory account.",
      "chunk_index": 165,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_166",
      "text": "Step 1 – In the Recovery Console, click your profile icon in the top right corner of the page and select Manage.",
      "chunk_index": 166,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_167",
      "text": "On disabling MFA, the page displays a confirmation message and there is an option to enable it again.",
      "chunk_index": 167,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_168",
      "text": "Domain Backup Configuration Page When you sign into the Recovery Console for the first time, the Domain Backup Configura tion interface is displayed.",
      "chunk_index": 168,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_169",
      "text": "Active Directory Page On the Active Directory page, you can access all the domains that you have configured through the Domains Page.",
      "chunk_index": 169,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_170",
      "text": "v2.6 Select a domain from the drop-down menu and expand it to view the domain tree and container structure, which is exactly the same as you get in Active Directory Users and Computers.",
      "chunk_index": 170,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_171",
      "text": "The page displays the following information: Name – The display name of the object Distinguished Name – The unique name identifying the object in the directory Description – A description of the object Type – The object type, showing whether it is a container, organizational unit, computer, group, user, etc.",
      "chunk_index": 171,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_172",
      "text": "Backup Time – The date and time of the last the backup You can perform the rollback and recover operations for objects.",
      "chunk_index": 172,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_173",
      "text": "v2.6 Search for an Object There are several ways to find an object: Column Filters – Click a column header to organize the table alphabetically by the column header.",
      "chunk_index": 173,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_174",
      "text": "Search box – Enter a text string in the search box to filter the table for results that contain the text.",
      "chunk_index": 174,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_175",
      "text": "Rollback an Object Select and expand a domain in the left pane and locate the object you want to rollback.",
      "chunk_index": 175,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_176",
      "text": "Recover Deleted Objects On expanding a domain in the left pane, you will notice that Recycle Bin is in blue, indicating that this is a virtual container specific to Recovery for Active Directory.",
      "chunk_index": 176,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_177",
      "text": "Integration with Threat Prevention When you right-click an object in a domain on the Active Directory page, the right-click menu is displayed as: The Show audit history and Show activity options are enabled only when both the following conditions are met: Threat Prevention data is tied with Recovery for Active Directory data v2.6 The user is logged in with an account that is specified in the Account section of the Netwrix Integrations Page These options display data from Threat Prevention.",
      "chunk_index": 177,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_178",
      "text": "On the Active Directory page, select and expand a domain in the left pane and locate the object you want to view the audit history for.",
      "chunk_index": 178,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_179",
      "text": "The following information is displayed for every action performed on the object: Who – The user who performed the action What – The action performed Success – Shows whether the action was successfully performed; True indicates success and False indicates failure v2.6 Where – The object the action was performed on When – The date and time of the action To view the details of an action, click the plus sign in the respective row to expand it.",
      "chunk_index": 179,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_180",
      "text": "Information includes the object attribute that was affected, the type of change made, and the old and new values.",
      "chunk_index": 180,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_181",
      "text": "View the Activity Perpetrated by an Object You can view the activity performed by an object in the environment.",
      "chunk_index": 181,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_182",
      "text": "On the Active Directory page, select and expand a domain in the left pane and locate the object whose activity you want to view.",
      "chunk_index": 182,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_183",
      "text": "The following information is displayed for the actions performed by the object: What – The action performed v2.6 Success – Shows whether the action was successfully performed; True indicates success and False indicates failure Where – The object the action was performed on When – The date and time of the action To view the details of an action, click the plus sign in the respective row to expand it.",
      "chunk_index": 183,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_184",
      "text": "Information includes the object attribute that was affected, the type of change made, and the old and new values.",
      "chunk_index": 184,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_185",
      "text": "Follow the steps to roll back an Active Directory object, including user accounts, groups, and organizational units.",
      "chunk_index": 185,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_186",
      "text": "Options are: Use any writable domain controller – The system picks any writable domain controller in the domain for the rollback operation Use a specific domain controller – Select a domain controller from the drop-down menu for the rollback operation Step 6 – Click Next.",
      "chunk_index": 186,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_187",
      "text": "v2.6 Step 7 – The account preforming the operation must have Domain Admin privileges to access the domain tree area where the object resides.",
      "chunk_index": 187,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_188",
      "text": "On the Credentials page: If the account specified during domain configuration has Domain Admin privileges, click Next.",
      "chunk_index": 188,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_189",
      "text": "If the domain account does not have Domain Admin privileges, select the Use alternate credentials to perform the object rollback checkbox and enter an account with Domain Admin privileges, then click Next.",
      "chunk_index": 189,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_190",
      "text": "For a Least Privilege Access Model to provision an Active Directory security group with the permissions that are necessary to perform backups, rollbacks and recovery, see the Least Privilege Access Model topic.",
      "chunk_index": 190,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_191",
      "text": "v2.6 Step 8 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 191,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_192",
      "text": "v2.6 Recover Objects The Recycle Bin enables you to view the objects deleted in domains monitored by Recovery for Active Directory.",
      "chunk_index": 192,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_193",
      "text": "Select and expand a domain in the left pane and click Recycle Bin to get a list of deleted objects in the domain.",
      "chunk_index": 193,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_194",
      "text": "The page displays the following information: Name – The display name of the object Distinguished Name – The unique name identifying the object in the directory Last Known Parent – The path of the parent of the object Type – The object type, showing whether it is a container, organizational unit, computer, group, user, etc.",
      "chunk_index": 194,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_195",
      "text": "Deleted On – The time and date when the object was deleted Time Left – The time remaining until the object is no longer recoverable v2.6 Search for an Object There are several ways to find an object: Column Filters – Click a column header to organize the table alphabetically by the column header.",
      "chunk_index": 195,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_196",
      "text": "Search box – Enter a text string in the search box to filter the table for results that contain the text.",
      "chunk_index": 196,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_197",
      "text": "Options are: Use any writable domain controller – The system picks any writable domain controller in the domain for the restore operation Use a specific domain controller – Select a domain controller from the drop-down menu for the restore operation Step 6 – Click Next.",
      "chunk_index": 197,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_198",
      "text": "v2.6 Step 7 – On the Recovery Options page, select the Container and Naming Conflict actions for the recovery process.",
      "chunk_index": 198,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_199",
      "text": "Select a container restore option from the drop-down menu: ◦◦ Only restore the container object – Restores the container object but no children ◦◦ Restore the container object and the immediate children – Restores the container object and its immediate children ◦◦ Restore the entire sub-tree – Restores the container object and all children NOTE: Selecting the Restore the container object and the immediate children or the Restore the entire sub-tree option enables the User Options page.",
      "chunk_index": 199,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_200",
      "text": "Naming Conflict – A naming conflict can occur if an object was created post-deletion that has identical values to the original object.",
      "chunk_index": 200,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_201",
      "text": "From the drop-down menu, select an option to implement if a naming conflict occurs: v2.6 ◦◦ Skip the object – If there is a conflict with naming, do not restore and skip the object ◦◦ Automatically use alternative values – If there is a conflict with naming, a numeric value will be appended to the name of the object being restored to create a unique name Step 8 – Click Next.",
      "chunk_index": 201,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_202",
      "text": "Enable user – Enables the user in Active Directory Clear 'User must change password' flag upon restoration – Restored users do not receive an alert to change their password upon first login after a recovery.",
      "chunk_index": 202,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_203",
      "text": "Step 11 – The account preforming the operation must have Domain Admin privileges to access the domain tree area where the object resides.",
      "chunk_index": 203,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_204",
      "text": "On the Credentials page: If the account specified during domain configuration has Domain Admin privileges, click Next.",
      "chunk_index": 204,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_205",
      "text": "If the domain account does not have Domain Admin privileges, select the Use alternate credentials to perform the object restore checkbox and enter an account with Domain Admin privileges, then click Next.",
      "chunk_index": 205,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_206",
      "text": "For a Least Privilege Access Model to provision an Active Directory security group with the permissions that are necessary to perform backups, rollbacks and recovery, see the Least Privilege Access Model topic.",
      "chunk_index": 206,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_207",
      "text": "v2.6 Step 12 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 207,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_208",
      "text": "v2.6 Forest Page The Forest page allows administrators to: Add forests Configure and manage backups for domain controllers in a forest.",
      "chunk_index": 208,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_209",
      "text": "Carry out a forest recovery Once a forest is added, you can view the domain controllers in the forest, whether backups are enabled for the domain controllers, and the last backup time.",
      "chunk_index": 209,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_210",
      "text": "Once a forest is added, the page is displayed as follows: v2.6 The domains in the configured forests are shown in a hierarchal tree.",
      "chunk_index": 210,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_211",
      "text": "The domain controllers for the selected forest are shown in the adjacent pane, with information such as backup status and last backup times.",
      "chunk_index": 211,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_212",
      "text": "The following information is displayed for a domain controller: Name – Name of the domain controller Operating System – Operating system for the domain controller, for example, Windows Server 2019 Standard Version – Version of the operating system Backup – Use the toggle button to enable or disable the backup for the domain controller.",
      "chunk_index": 212,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_213",
      "text": "See the Add Backup Configurations for a Domain Controller topic to configure backup settings for the domain controller.",
      "chunk_index": 213,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_214",
      "text": "Last Backup Time – Date and time when the last backup occurred Actions – Displays the following icons: ◦◦ Start Backup – Starts a backup of the server on demand v2.6 ◦◦ Edit Configuration – Launches the Server Backup Configuration wizard, enabling you to modify the backup configurations for the domain controller ◦◦ Add Domain Controller to Restore Playbook – Adds the domain controller to the recovery playbook.",
      "chunk_index": 214,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_215",
      "text": "Step 3 – Enter the account username [DOMAIN\\USERNAME] to be used to connect to the forest in the Account field.",
      "chunk_index": 215,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_216",
      "text": "Click it to view the domain controllers in the forest and configure backup settings for each domain controller.",
      "chunk_index": 216,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_217",
      "text": "Add Backup Configurations for a Domain Controller When you configure backup settings for a domain controller, the system automatically installs the Netwrix Server Backup Configuration agent on that domain controller.",
      "chunk_index": 217,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_218",
      "text": "NOTE: Ensure that the domain controller has the firewall rules configured before c onfiguring backup settings for it.",
      "chunk_index": 218,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_219",
      "text": "To locate a domain controller in a specific domain, expand the forest in the left pane and select a domain.",
      "chunk_index": 219,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_220",
      "text": "Step 1 – Enable the Backup toggle button for a domain controller to launch the Server Backup Configuration wizard.",
      "chunk_index": 220,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_221",
      "text": "v2.6 Step 2 – In the Server field, the domain controller to be backed up is displayed as read-only in the following format: server.domain.com.",
      "chunk_index": 221,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_222",
      "text": "Step 3 – Specify an account to validate the server, install the Netwrix Server Backup Configuration agent there, and perform server backups.",
      "chunk_index": 222,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_223",
      "text": "In the Account field, enter the username of an account to write the backup data of the domain controller to the network share of the destination server in the following format: domain\\account.",
      "chunk_index": 223,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_224",
      "text": "NOTE: The backup data is first stored locally on the server and copied to the storage location using this account.",
      "chunk_index": 224,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_225",
      "text": "v2.6 Step 5 – Select the days of the week in the Run the backup on section to indicate the days when backups will be run.",
      "chunk_index": 225,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_226",
      "text": "v2.6 Step 8 – In the Specify where you would like to store the backup data field, enter a path to a network share on the domain controller to store the backup data.",
      "chunk_index": 226,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_227",
      "text": "Step 9 – The file can be encrypted by selecting the Encrypt the generated backup data checkbox and entering a password.",
      "chunk_index": 227,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_228",
      "text": "v2.6 Step 12 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 228,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_229",
      "text": "Backup Files The backup of a domain controller is stored on a network share in the environment and includes all essential data from the domain controller, ensuring that the entire forest can be restored in the event of a disaster.",
      "chunk_index": 229,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_230",
      "text": "The backup includes: The Active Directory database (ntds.dit) Log files System hive of the registry The sysvol container Disable Server Backup for a Domain Controller If you do not want a domain controller to be backed up, simply disable the backup for it.",
      "chunk_index": 230,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_231",
      "text": "To locate a domain controller in a specific domain, expand the forest in the left pane and select a domain.",
      "chunk_index": 231,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_232",
      "text": "To re-enable the backup for a domain controller, you have to perform all steps of the Server Backup Configuration wizard again.",
      "chunk_index": 232,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_233",
      "text": "Domain Controller Backup History You can view the backup history for a domain controller, which includes information on all previous domain controller backups.",
      "chunk_index": 233,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_234",
      "text": "To locate a domain controller in a specific domain, expand the forest in the left pane and select a domain.",
      "chunk_index": 234,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_235",
      "text": "The following information is displayed for each backup: Backup Time – Date and time the backup was created Location – The network share path where the backup file is stored on the domain controller Size – The size of the backup file Status – Progress status of the backup; Queued, Running, or Finished Encrypted – Displays if the backup file is encrypted (True) or not encrypted (False) v2.6 Forest Recovery See the Recover a Forest topic for information on how to recover a forest.",
      "chunk_index": 235,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_236",
      "text": "Recover a Forest You can recover a forest using the domain controller backups generated by Recovery for Active Directory.",
      "chunk_index": 236,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_237",
      "text": "Once the desired domain controllers have been added to the restore playbook, the forest recovery process can be initiated and the forest will be restored using the automated process provided by Recovery for Active Directory.",
      "chunk_index": 237,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_238",
      "text": "Use Cases for Restoring Domain Controller Backups Administrators may need to bring a forest backup created by Recovery for Active Directory online in the following scenarios: Stand up a duplicate of a domain controller, for example, stand up a duplicate in a lab environment for testing purposes Restore a server or domain controller to a specific state-in-time image Restore lost or deleted data Prerequisites To perform a forest recovery, the following prerequisites must be in place: Configure backups for one or more domain controllers in each domain in a forest.",
      "chunk_index": 238,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_239",
      "text": "See the Target Server Considerations topic to understand the requirements for a target environment and target servers for restoring domain controllers.",
      "chunk_index": 239,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_240",
      "text": "Step 2 – Add the desired domain controllers to create a recovery playbook, also called a restore playbook.",
      "chunk_index": 240,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_241",
      "text": "For example, if you have a forest with one root domain and four child domains, you can add one domain controller from the root domain and one from each of the child domains to the recovery playbook, and restore your forest.",
      "chunk_index": 241,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_242",
      "text": "Step 3 – When your playbook is complete, use the \"Start\" command to start the forest recovery process.",
      "chunk_index": 242,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_243",
      "text": "The following restore capabilities are supported: VM DC backup to VM VM DC backup to Physical Physical DC backup to VM Physical DC backup to Physical DC Create a Recovery Playbook A recovery playbook is a list of domains and domain controllers for those domains that you want to restore to an isolated environment.",
      "chunk_index": 243,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_244",
      "text": "For example, you can choose a Hyper-V or a VMware environment hosted in Azure or AWS, and isolated from the rest of the domain.",
      "chunk_index": 244,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_245",
      "text": "Once the desired domain controllers have at least one backup to choose from, you can start the forest recovery playbook by adding the domain controllers to it.",
      "chunk_index": 245,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_246",
      "text": "Any other domains can then be added via the playbook or you should handle them manually using the \"add DC to the domain, let replication happen\" model.",
      "chunk_index": 246,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_247",
      "text": "To locate a domain controller in a specific domain, expand the forest in the left pane and select a domain.",
      "chunk_index": 247,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_248",
      "text": "Step 3 – Click the Add Domain Controller to Restore Playbook icon (+) for a domain controller to add it to the recovery playbook.",
      "chunk_index": 248,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_249",
      "text": "The Add to Recovery Playbook wizard opens, where you can specify the restore settings for the domain controller.",
      "chunk_index": 249,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_250",
      "text": "Step 4 – On the Domain Controller page, the Source Domain Controller section displays information for the domain controller that is being added to the playbook.",
      "chunk_index": 250,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_251",
      "text": "It displays the domain it is deployed to, its name, operating system, and the date and time of the most recent backup.",
      "chunk_index": 251,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_252",
      "text": "In the Target Server section: In the Server field, enter the IP address of the target server where you want to restore the domain controller from the backup.",
      "chunk_index": 252,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_253",
      "text": "Step 6 – From the Backup drop-down menu, select the backup to use for restoring the domain controller.",
      "chunk_index": 253,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_254",
      "text": "NOTE: If you do not choose a backup for a domain controller, an attempt will be made to join the domain controller to the existing domain that was restored previously in the playbook using a backup of another domain controller.",
      "chunk_index": 254,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_255",
      "text": "Step 7 – If the backup is encrypted, provide the password used for encryption in the Encryption Password field.",
      "chunk_index": 255,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_256",
      "text": "Step 8 – From the Roles drop-down menu, select the FSMO role(s) the domain controller will acquire when it is restored.",
      "chunk_index": 256,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_257",
      "text": "v2.6 Select Restore original roles to retain the previously assigned roles that are defined in the backup.",
      "chunk_index": 257,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_258",
      "text": "This option is selected by default, because the first domain controller in your domain automatically acquires all the FSMO roles.",
      "chunk_index": 258,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_259",
      "text": "Step 9 – In the DSRM Password field, set the Directory Services Restore Mode (DSRM) password for the to-be-restored domain controller.",
      "chunk_index": 259,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_260",
      "text": "Step 11 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 260,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_261",
      "text": "v2.6 The following information is displayed for a domain controller in the playbook: Original Server – The name of the server that you added to the playbook for restore Target Server – The server where the domain should be restored Domain – The domain the domain controller belongs to Operating System – The operating system of the original server (the domain controller to be restored) Version – The operating system of the original server (the domain controller to be restored) Roles – The FSMO role(s) the domain controller will acquire when restored Backup Time – the date and time of the backup that will be restored for the domain controller v2.6 Run the Recovery Playbook When your playbook is ready, click Start to initiate the forest recovery process.",
      "chunk_index": 261,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_262",
      "text": "The machine will reboot once the recovery process is complete Your new forest is ready for you to log in using any Administrator credentials from the forest.",
      "chunk_index": 262,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_263",
      "text": "From here, you can proceed to restore additional domain controllers or promote new ones to the forest.",
      "chunk_index": 263,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_264",
      "text": "Configuration Interface The Configuration interface provides access to configure the domains, users and roles, notifications, integrations, data retention policy, and licensing for Recovery for Active Directory.",
      "chunk_index": 264,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_265",
      "text": "v2.6 The Configuration interface contains the following pages: Domains Page – The Domains page provides a list of the domains backed up by Recovery for Active Directory.",
      "chunk_index": 265,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_266",
      "text": "Users and Roles Page – The Users and Roles page displays the accounts with access to Recovery for Active Directory.",
      "chunk_index": 266,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_267",
      "text": "Notifications Page – The Notifications page allows the configuration of notifications, which is required for sending an email when a collection (backup) job is completed.",
      "chunk_index": 267,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_268",
      "text": "Netwrix Integrations Page – The Netwrix Integrations page provides the ability to configure access to the data in other Netwrix products.",
      "chunk_index": 268,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_269",
      "text": "Data Retention Policy Page – The Data Retention Policy page provides settings for deleting backup data that of domains and domain controllers has aged by X number of days, and for deleting backup data for tombstone objects that have been purged.",
      "chunk_index": 269,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_270",
      "text": "Licensing Page – The Licensing page provides an overview of the organization's license status and the ability to import a license file.",
      "chunk_index": 270,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_271",
      "text": "Domains Page The Domains page provides a list of the domains backed up by Recovery for Active Directory.",
      "chunk_index": 271,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_272",
      "text": "v2.6 The table displays the following information: Domain – Fully-qualified name of the domain Last Collection Time – The most recent time the collection (backup) occurred Duration – The time the collection took to complete Status – Collection state as idle, waiting, error, or success Details – Information about any errors that occurred when the last backup was performed Actions – Displays the icons used to collect, edit, and delete the respective domain ◦◦ Run backup – Click the Play icon to start a new collection (backup) on the respective domain if collection is needed outside of the configured schedule ◦◦ Edit configuration – Edit the settings of the domain.",
      "chunk_index": 272,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_273",
      "text": "Click the Edit icon for a domain to open the Edit Domain Configuration wizard and edit the domain's settings.",
      "chunk_index": 273,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_274",
      "text": "◦◦ Delete configuration – Click the Delete icon for a domain to delete it To add a domain, click the Add domain configuration button.",
      "chunk_index": 274,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_275",
      "text": "Step 1 – Click the Add domain configuration button on the Domains page to launch the Add Domain Configuration wizard.",
      "chunk_index": 275,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_276",
      "text": "Step 3 – Enter the account username [DOMAIN\\USERNAME] to be used for backups, rollbacks, and recoveries in the Account field.",
      "chunk_index": 276,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_277",
      "text": "NOTE: The account must have Domain Admin privileged access to read and write object data in order to back up, rollback, and restore objects in Active Directory.",
      "chunk_index": 277,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_278",
      "text": "If the account has read rights only, it will be able to back up the domain but unable to rollback and restore objects.",
      "chunk_index": 278,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_279",
      "text": "In this case, alternate credentials with read and write access to objects will have to be provided on the Credentials page of the Object Rollback and Object Restore wizards.",
      "chunk_index": 279,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_280",
      "text": "v2.6 For a Least Privilege Access Model to provision an Active Directory security group with the permissions that are necessary to perform backups, rollbacks and recovery, see the Least Privilege Access Model topic.",
      "chunk_index": 280,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_281",
      "text": "Step 6 – Select the days of the week in the Run the backup on section to indicate the days when backups will be run.",
      "chunk_index": 281,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_282",
      "text": "Step 8 – In the Repeat every field, enter a frequency, in minutes, to set the time between the start of each domain backup.",
      "chunk_index": 282,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_283",
      "text": "NOTE: If the start time is changed from the default and a frequency is selected (in minutes), the backups will run at the desired frequency but will skip from midnight until the selected start time.",
      "chunk_index": 283,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_284",
      "text": "Step 10 – If the Collect GPOs checkbox is selected, the Store the Group Policy Object backups in the following location field is enabled.",
      "chunk_index": 284,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_285",
      "text": "v2.6 Step 12 – To set notifications, select the Send email notifications check box and enter the email address of one or more users and/or groups to receive the job start and end notifications.",
      "chunk_index": 285,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_286",
      "text": "v2.6 Step 14 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 286,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_287",
      "text": "Then, subsequent backups only include the incremental changes that occurred since the previous backup.",
      "chunk_index": 287,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_288",
      "text": "Step 3 – Modify the account username [DOMAIN\\USERNAME] to be used for backups, rollbacks, and recoveries in the Account field, as needed.",
      "chunk_index": 288,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_289",
      "text": "v2.6 Step 6 – Modify the selection of the check boxes in the Run the backup on section to indicate the days when backups will be run, as needed.",
      "chunk_index": 289,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_290",
      "text": "Step 7 – Modify the start time (UTC) in the Start the backup at field to begin the backup, as needed.",
      "chunk_index": 290,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_291",
      "text": "Step 8 – In the Repeat every field, modify the frequency, in minutes, to set the time between the start of each domain backup.",
      "chunk_index": 291,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_292",
      "text": "NOTE: If the start time is changed from the default and a frequency is selected (in minutes), the backups will run at the desired frequency but will skip from midnight until the selected start time.",
      "chunk_index": 292,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_293",
      "text": "v2.6 Step 10 – (Optional) Select or deselect the Collect GPOs checkbox to enable or disable GPO rollback and recovery.",
      "chunk_index": 293,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_294",
      "text": "Step 11 – If the Collect GPOs checkbox is selected, the Store the Group Policy Object backups in the following location field is enabled.",
      "chunk_index": 294,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_295",
      "text": "v2.6 Step 13 – To set notifications, select the Send email notifications check box and enter the email address of one or more users and/or groups to receive the job start and end notifications.",
      "chunk_index": 295,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_296",
      "text": "v2.6 Step 14 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 296,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_297",
      "text": "Users and Roles Page The Users and Roles page displays the accounts with access to Recovery for Active Directory.",
      "chunk_index": 297,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_298",
      "text": "v2.6 The table displays the following information: Account – Login username displayed in the [DOMAIN\\USERNAME] format for Active Directory accounts Type – The type of account, an individual or group account Role – The role assigned to the account.",
      "chunk_index": 298,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_299",
      "text": "◦◦ Administrator – This role allows full control of Recovery for Active Directory, including adding domains, configuring notifications, and adding and removing users.",
      "chunk_index": 299,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_300",
      "text": "◦◦ Operator – This role allows access to the Active Directory and Forest nodes, and can perform rollback and recovery tasks for domains and forests through the Recovery Console.",
      "chunk_index": 300,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_301",
      "text": "Action – Actions that can be performed on user accounts ◦◦ Remove – Click Remove to remove the respective user or group from console access.",
      "chunk_index": 301,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_302",
      "text": "v2.6 Step 2 – Enter a user's first or last name, display name, sAMAccountName, or group name in the Search field.",
      "chunk_index": 302,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_303",
      "text": "v2.6 Step 4 – Select the Administrator or Operator role for the account from the Role drop-down menu.",
      "chunk_index": 303,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_304",
      "text": "Administrator – This role allows full control of Recovery for Active Directory, including adding domains, configuring notifications, and adding and removing users.",
      "chunk_index": 304,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_305",
      "text": "Operator – This role allows access to the Active Directory and Forest nodes, and can perform rollback and recovery tasks for domains and forests through the Recovery Console.",
      "chunk_index": 305,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_306",
      "text": "v2.6 Step 6 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 306,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_307",
      "text": "v2.6 Remove a User or Group Follow the steps below to remove a user's or group's access to the Recovery Console.",
      "chunk_index": 307,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_308",
      "text": "Notifications Page The Notifications page allows the configuration of notifications, which is required for sending an email when a collection (backup) job is completed.",
      "chunk_index": 308,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_309",
      "text": "If the SMTP server does not require authentication, the Account name and Account password fields can be left blank.",
      "chunk_index": 309,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_310",
      "text": "SMTP Server – The server and port information Account Name – Name of the account to use for accessing the mail server Account Password – Password for the account Step 3 – Select an encryption protocol to encode the email notifications from the Encryption method drop-down menu.",
      "chunk_index": 310,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_311",
      "text": "Step 4 – In the Send Email As section, configure the email address and display name to use for sending email notifications.",
      "chunk_index": 311,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_312",
      "text": "Email address – Create an email address to be used, for example: noreply@companyname.com Display name – Name to be displayed on the email notifications v2.6 Step 5 – Click the Test button to verify the notifications are configured correctly.",
      "chunk_index": 312,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_313",
      "text": "Netwrix Integrations Page The Netwrix Integrations page provides the ability to configure access to the data in other Netwrix products.",
      "chunk_index": 313,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_314",
      "text": "This enables Recovery for Active Directory to pull object data from the integrated product and tie it with that same object's data in Recovery for Active Directory.",
      "chunk_index": 314,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_315",
      "text": "Users can then view the audit history and activity data coming from Threat Prevention for objects on the Active Directory Page.",
      "chunk_index": 315,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_316",
      "text": "Then click the Netwrix Integrations tab on the Configuration page to open the Netwrix Integrations page.",
      "chunk_index": 316,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_317",
      "text": "Step 1 – On the Netwrix Integrations page, use the Auditing Product Integration drop-down menu to select a product for integration.",
      "chunk_index": 317,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_318",
      "text": "Step 2 – In the SQL Server field, enter the IP address or the server name of the SQL server where the Threat Prevention database resides.",
      "chunk_index": 318,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_319",
      "text": "v2.6 Step 3 – Select the option button for Windows authentication or SQL authentication to set the authentication mode.",
      "chunk_index": 319,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_320",
      "text": "Windows authentication uses the credentials provided on the Netwrix Recovery Server Configuration page of the Recovery for Active Directory Setup wizard.",
      "chunk_index": 320,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_321",
      "text": "Step 5 – Recovery for Active Directory users do not have access to audit data in Threat Prevention; hence they cannot view it in Recovery for Active Directory.",
      "chunk_index": 321,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_322",
      "text": "Only the users that log into Recovery for Active Directory with any of the specified accounts will be able to fetch and view audit and activity data from Threat Prevention for domain objects.",
      "chunk_index": 322,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_323",
      "text": "v2.6 Enter a user's first or last name, display name, sAMAccountName, or group name in the Search field.",
      "chunk_index": 323,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_324",
      "text": "Data Retention Policy Page The Data Retention Policy page provides settings for deleting backup data that of domains and domain controllers has aged by X number of days, and for deleting backup data for tombstone objects that have been purged.",
      "chunk_index": 324,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_325",
      "text": "Then click the Data Retention Policy tab on the Configuration page to open the Data Retention Policy page.",
      "chunk_index": 325,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_326",
      "text": "Step 1 – On the Data Retention Policy page, select the Enable data retention policy checkbox to enable policy settings.",
      "chunk_index": 326,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_327",
      "text": "Step 2 – Select the Delete object backup data older than X days checkbox to delete backup data that is older than X number of days from the database.",
      "chunk_index": 327,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_328",
      "text": "Step 3 – Select the Delete backup data for objects that have been purged from the deleted objects container checkbox to delete data from the database for tombstone objects that have been purged.",
      "chunk_index": 328,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_329",
      "text": "NOTE: The 'deleted objects container' is represented by the Recycle Bin in Recovery for Active Directory.",
      "chunk_index": 329,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_330",
      "text": "The object is not physically deleted but is stripped off most of its attributes and is flagged as deleted.",
      "chunk_index": 330,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_331",
      "text": "The object remains in tombstone state for 180 days by default, after which it is permanently deleted from Active Directory.",
      "chunk_index": 331,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_332",
      "text": "Selecting the Delete backup data for objects that have been purged from the deleted objects container checkbox deletes data for permanently deleted objects from Recovery for Active Directory.",
      "chunk_index": 332,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_333",
      "text": "RECOMMENDED: As permanently deleted objects cannot be rolled back or recovered using Recovery for Active Directory, it is recommended to enable this setting.",
      "chunk_index": 333,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_334",
      "text": "v2.6 Licensing Page The Licensing page provides an overview of the organization's license status and the ability to import a license file.",
      "chunk_index": 334,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_335",
      "text": "Step 3 – Locate the license key file for Recovery for Active Directory in the file explorer and click Open.",
      "chunk_index": 335,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_336",
      "text": "v2.6 Audit Logs Page The Audit Logs page provides an audit trail of the actions performed by users in Recovery for Active Directory.",
      "chunk_index": 336,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_337",
      "text": "The following information is displayed for an event: Action – The action perpetrated by the account Object – The name of the object affected by the change Account – The account that made the change Event Time – The time the action was perpetrated To view the details of an event, click the arrow next to it to expand it.",
      "chunk_index": 337,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_338",
      "text": "v2.6 v2.6 RSAT Extension The RSAT Extension is an MMC snap-in that can be installed on domain joined machines.",
      "chunk_index": 338,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_339",
      "text": "It extends the Active Directory Users and Computers (ADUC) console with Recovery for Active Directory specific right-click options for object rollback and recovery.",
      "chunk_index": 339,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_340",
      "text": "Consider the following: The RSAT Extension is automatically installed with the Recovery for Active Directory installation package on the Recovery Application Server.",
      "chunk_index": 340,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_341",
      "text": "The local Extension must be registered on the server to enable the rollback and restore options in ADUC.",
      "chunk_index": 341,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_342",
      "text": "The Extension connects to the Recovery Application Server using the server name or IP address you provide while installing the Extension on the remote machine.",
      "chunk_index": 342,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_343",
      "text": "You must register the RSAT Extension on the Recovery Application Server to add the Rollback and Restore options to the ADUC console.",
      "chunk_index": 343,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_344",
      "text": "Object Rollback The Rollback feature in the Active Directory Users and Computers (ADUC) console allows you to revert an Active Directory object to a previous state of a Recovery for Active Directory backup.",
      "chunk_index": 344,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_345",
      "text": "Prerequisites The following prerequisites must be met before you can rollback or recover an object using ADUC: You must register the RSAT Extension on the Recovery Application Server to add the Rollback and Restore options to the ADUC console.",
      "chunk_index": 345,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_346",
      "text": "v2.6 Rollback an Object Using ADUC Follow the steps to roll back an Active Directory object, including user accounts, groups, and organizational units.",
      "chunk_index": 346,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_347",
      "text": "v2.6 Step 2 – On the Object Backups page, select a backup date and then select the object and attribute(s) to rollback.",
      "chunk_index": 347,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_348",
      "text": "This page consists of two sections: Objects – Lists the objects selected for rollback Backups – Lists the backup(s) with their respective details ◦◦ Backup Date – Select the desired date timestamp to identify the backup for rollback.",
      "chunk_index": 348,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_349",
      "text": "◦◦ Only show attributes that have changed – Select this option to display only blue highlighted attributes that were changed when the selected backup was performed v2.6 You can click on different backup dates to see attribute values for each of those points in time.",
      "chunk_index": 349,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_350",
      "text": "This page consists of two sections: Domain Controller ◦◦ Use the current domain controller ◦◦ Use any writable domain controller ◦◦ Use the selected domain controller – Select a domain controller from the drop-down menu v2.6 Details – Provides information about the selected domain controller Click Next.",
      "chunk_index": 350,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_351",
      "text": "Step 4 – The account preforming the operation must have Domain Admin privileges to access the domain tree area where the object resides.",
      "chunk_index": 351,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_352",
      "text": "On the Alternate Credentials page: If the account specified during domain configuration has Domain Admin privileges, click Next.",
      "chunk_index": 352,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_353",
      "text": "If the domain account does not have Domain Admin privileges, select the Use alternate credentials for the rollback operation checkbox and enter an account with Domain Admin privileges, then click Next.",
      "chunk_index": 353,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_354",
      "text": "For a Least Privilege Access Model to provision an Active Directory security group with the permissions that are necessary to perform backups, rollbacks and recovery, see the Least Privilege Access Model topic.",
      "chunk_index": 354,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_355",
      "text": "v2.6 Step 5 – On the Confirm page, review the object information, changes, and the domain controller selection.",
      "chunk_index": 355,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_356",
      "text": "Restore an Object The Restore feature recovers deleted objects (users, computers, groups, OUs, etc.)",
      "chunk_index": 356,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_357",
      "text": "Prerequisites The following prerequisites must be met before you can rollback or recover an object using ADUC: You must register the RSAT Extension on the Recovery Application Server to add the Rollback and Restore options to the ADUC console.",
      "chunk_index": 357,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_358",
      "text": "v2.6 Step 2 – In the Recycle Bin, right-click on the object to be restored and select Restore on the menu.",
      "chunk_index": 358,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_359",
      "text": "v2.6 Step 3 – On the Object Backups page, select the desired date timestamp to identify the backup for recovery.",
      "chunk_index": 359,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_360",
      "text": "v2.6 Step 4 – On the Recovery Options page, select the Container and Naming Conflict actions for the recovery process.",
      "chunk_index": 360,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_361",
      "text": "Select a container restore option from the drop-down menu: ◦◦ Only restore the container object – Restores the container object but no children ◦◦ Restore the container object and the immediate children – Restores the container object and its immediate children ◦◦ Restore the entire sub-tree – Restores the container object and all children NOTE: Selecting the Restore the container object and the immediate children or the Restore the entire sub-tree option enables the User Options page.",
      "chunk_index": 361,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_362",
      "text": "v2.6 Naming Conflict – A naming conflict can occur if an object was created post-deletion that has identical values to the original object.",
      "chunk_index": 362,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_363",
      "text": "From the drop-down menu, select an option to implement if a naming conflict occurs: ◦◦ Skip the object – If there is a conflict with naming, do not restore and skip the object ◦◦ Automatically use alternative values – If there is a conflict with naming, a numeric value will be appended to the name of the object being restored to create a unique name Click Next.",
      "chunk_index": 363,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_364",
      "text": "Consider the following configurations in ADUC before choosing the options for deleted user objects: v2.6 Passwords are not persisted – User account is disabled and will have no password, and be disabled after restoration Passwords are persisted – User password is restored and ADUC automatically sets the User must change password at next logon flag Select the desired checkboxes relating to the state of a user password upon restoration: Enable user – Enables the user in Active Directory Clear 'User must change password' flag upon restoration – Restored users do not receive an alert to change their password upon first login after a recovery.",
      "chunk_index": 364,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_365",
      "text": "v2.6 Step 6 – On the Domain Controller page, select the Domain Controller to run the restoration action.",
      "chunk_index": 365,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_366",
      "text": "This page consists of two sections: Domain Controller ◦◦ Use the current domain controller ◦◦ Use any writable domain controller ◦◦ Use the selected domain controller – Select a domain controller from the drop-down menu Details – Provides information about the selected domain controller Click Next.",
      "chunk_index": 366,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_367",
      "text": "v2.6 Step 7 – The account preforming the operation must have Domain Admin privileges to access the domain tree area where the object resides.",
      "chunk_index": 367,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_368",
      "text": "On the Alternate Credentials page: If the account specified during domain configuration has Domain Admin privileges, click Next.",
      "chunk_index": 368,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_369",
      "text": "If the domain account does not have Domain Admin privileges, select the Use alternate credentials for the recovery operation checkbox and enter an account with Domain Admin privileges, then click Next.",
      "chunk_index": 369,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_370",
      "text": "For a Least Privilege Access Model to provision an Active Directory security group with the permissions that are necessary to perform backups, rollbacks and recovery, see the Least Privilege Access Model topic.",
      "chunk_index": 370,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_371",
      "text": "v2.6 Troubleshooting This topic provides steps for troubleshooting common issues for the following Recovery for Active Directory components: RSAT Extension Recovery Diagnostics RSAT Extension Rollback Diagnostics RSAT Extension Registration Diagnostics Recovery Application Server Diagnostics RSAT Extension Recovery The RSAT Extension Recovery Diagnostics flow chart helps diagnose issues when the Recycle Bin is missing or empty in Active Directory Users and Computers (ADUC).",
      "chunk_index": 371,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_372",
      "text": "v2.6 RSAT Extension Rollback The RSAT Extension Rollback Diagnostics flow chart helps diagnose issues when the rollback right-click menu option is missing in ADUC.",
      "chunk_index": 372,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_373",
      "text": "RSAT Extension Registration Validation In the Recovery Configuration Utility, the RSAT Extension Register/Unregister button is used to activate the new right-click menu options in ADUC.",
      "chunk_index": 373,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_374",
      "text": "Follow the steps to validate the registration status of the RSAT Extension by finding the presence of a specific GUID in ADSI Edit.",
      "chunk_index": 374,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_375",
      "text": "Step 1 – On the domain joined machine or domain controller, ensure the user is logged in as a Domain Administrator.",
      "chunk_index": 375,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_376",
      "text": "Step 2 – Open ADSI (Active Directory Services Interfaces Editor) by navigating to C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Administrative Tools.",
      "chunk_index": 376,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_377",
      "text": "v2.6 Step 3 – If the Configuration naming context does not display automatically, navigate to Action > Connect to... and the Connection Settings window opens.",
      "chunk_index": 377,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_378",
      "text": "Step 4 – On the Connection Settings window, select Configuration under the Select a well known Naming Context radio button.",
      "chunk_index": 378,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_379",
      "text": "The Connection Settings window closes and the AD Configuration Partition (also called naming context) opens on the left hand pane.",
      "chunk_index": 379,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_380",
      "text": "Step 5 – Navigate from the AD Configuration Partition folder until CN=DisplaySpecifiers is selected.",
      "chunk_index": 380,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_381",
      "text": "In this folder, select either CN=409 which is the code for US English or another code for the active locale of the operating system if not using US English.",
      "chunk_index": 381,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_382",
      "text": "Select the adminContextMenu attribute or click Edit to show the Multi-valued String Editor listing known GUIDs.",
      "chunk_index": 382,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_383",
      "text": "In the list, the RSAT Extension GUID entry is: {50fb3a3c-5700-4232-ae3b-c6d49a6a97ab} NOTE: The adminContextMenu attribute of every object in the active locale (i.e.",
      "chunk_index": 383,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_384",
      "text": "Recovery Application Server The Recovery Application Server Diagnostics flow chart helps diagnose issues when the Netwrix Recovery Server service is not running.",
      "chunk_index": 384,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_385",
      "text": "v2.6 Log Files Log files are available at the following locations: On the Recovery for Active Directory server ...\\Netwrix\\Recovery for Active Directory\\Logs ...\\Netwrix\\Recovery for Active Directory\\ModuleEngine.exe.log ...\\Netwrix\\Recovery for Active Directory\\TaskServer.exe.log On the domain controllers for backups ...\\Netwrix\\Recovery for Active Directory\\Logs Update Account Passwords Account passwords occasionally need to be updated due to various reasons, such as security policies that require passwords to be reset on a regular basis.",
      "chunk_index": 385,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_386",
      "text": "The following types of credentials may be impacted by password changes or security policies: SQL Server Service Account Recovry Service Account v2.6 Domain Controller Backup Service Account SQL Server Service Account The SQL Server service account grants access to the SQL Server database.",
      "chunk_index": 386,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_387",
      "text": "Recovry Service Account The Recovery service account is used to run the Recovery Console service and preform the domain backups.",
      "chunk_index": 387,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_388",
      "text": "Domain Controller Backup Service Account The backup service account for a domain controller is used to write the backup file of the domain controller to a network share of the destination server.",
      "chunk_index": 388,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_389",
      "text": "Update Domain Controller Backup Account Password While adding backup configurations for a domain controller on the Forest page, an account is provided for performing domain controller backups.",
      "chunk_index": 389,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_390",
      "text": "To locate a domain controller in a specific domain, expand the forest in the left pane and select a domain.",
      "chunk_index": 390,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_391",
      "text": "Step 3 – Click the Edit button for a domain controller, which is available in the far right of the domain controller row.",
      "chunk_index": 391,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_392",
      "text": "v2.6 Step 4 – On the Server page, the fields are populated with the information you provided when configuring the domain controller backup.",
      "chunk_index": 392,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_393",
      "text": "v2.6 Step 7 – The Confirm page displays a summary of the settings you provided on the pages of the wizard.",
      "chunk_index": 393,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_394",
      "text": "Step 8 – Click OK. v2.6 The backup account password for the domain controller has been updated and saved.",
      "chunk_index": 394,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_395",
      "text": "Update SQL Server Service Account Password Follow the steps to update the password for the SQL Server service account.",
      "chunk_index": 395,
      "total_chunks": 397
    },
    {
      "chunk_id": "netwrix_recovery_for_active_directory_v2_6_2025-05-28-14-52-09_396",
      "text": "Step 1 – To launch the Recovery Configuration Utility, double-click the Recovery_Config.ex e executable at the following location in the Recovery for Active Directory installation directory: ...Netwrix\\Recovery for Active Directory\\Recovery_Config.exe Step 2 – Update the account password for SQL Server Authentication in the Login and Password fields.",
      "chunk_index": 396,
      "total_chunks": 397
    }
  ]
}